In [1]:
import pandas as pd
import numpy as np
file_to_load = "Resources/purchase_data.csv"
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
Unique_Player = purchase_data["SN"].value_counts()
Unique_Player

Lisosia93        5
Idastidru52      4
Iral74           4
Ialallo29        3
Inguron55        3
                ..
Assesi91         1
Saida58          1
Lirtirra37       1
Phaedasurap84    1
Lisirra58        1
Name: SN, Length: 576, dtype: int64

In [47]:
Length = len(Unique_Player)
Length

576

In [5]:
player_dict = [{"Total Players": Length}]
player_df = pd.DataFrame(player_dict)
player_df

   Total Players
0            576

In [6]:
Sum_Price = purchase_data["Price"].sum()
Sum_Price
Unique_Items = purchase_data["Item Name"].value_counts()
Number_Unique = len(Unique_Items)
Number_Unique
Number_Purchases = purchase_data["Purchase ID"].value_counts()
Total_Purc = len(Number_Purchases)
Total_Purc
Avg_Price = Sum_Price/Total_Purc
Round_Avg_Price = round(Avg_Price,2)
Round_Avg_Price

3.05

In [7]:
purchasing_df = pd.DataFrame(
    {"Number of Unique Items":[Number_Unique],
     "Average Price": ["$" + str(Round_Avg_Price)],
     "Number of Purchases":[Total_Purc],
     "Total Revenue": ["$" + str(Sum_Price)]
    }
)
purchasing_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

In [8]:
"${0:,.2f}".format(Avg_Price)

'$3.05'

In [9]:
Gender_Count = purchase_data["Gender"].value_counts()
Gender_Count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [10]:
df = purchase_data.set_index("Gender")
df.head()

,Purchase ID,SN,Age,Item ID,Item Name,Price
Gender,,,,,,
Male,0,Lisim78,20,108,"Extraction, Quickblade Of Trembling Hands",3.53
Male,1,Lisovynya38,40,143,Frenzied Scimitar,1.56
Male,2,Ithergue48,24,92,Final Critic,4.88
Male,3,Chamassasya86,24,100,Blindscythe,3.27
Male,4,Iskosia90,23,131,Fury,1.44

In [11]:
Male = df.loc["Male","SN"].value_counts()
Male_Total = len(Male)
Male_Total

484

In [12]:
Female = df.loc["Female","SN"].value_counts()
Female_Total = len(Female)
Female_Total

81

In [13]:
Other = df.loc["Other / Non-Disclosed","SN"].value_counts()
Other_Total = len(Other)
Other_Total

11

In [14]:
RoundMT = round((Male_Total/Length * 100),2)
RoundMT

84.03

In [15]:
RoundFT = round((Female_Total/Length * 100),2)
RoundFT

14.06

In [16]:
RoundOT = round((Other_Total/Length * 100),2)
RoundOT

1.91

In [17]:
gender_df = pd.DataFrame(
    {"Total Count": [Male_Total, Female_Total, Other_Total],
    "Percentage of Players": [str(RoundMT) + "%", str(RoundFT) + "%", str(RoundOT) + "%"],
    },
    index = ["Male", "Female", "Other/Non-Disclosed"]
)
gender_df

                     Total Count Percentage of Players
Male                         484                84.03%
Female                        81                14.06%
Other/Non-Disclosed           11                 1.91%

In [18]:
Male_Purch = purchase_data["Gender"].value_counts()
Male_Purch

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [19]:
M_ID = df.loc["Male","Purchase ID"].value_counts()
Male_PID = len(M_ID)
Male_PID

652

In [20]:
F_ID = df.loc["Female","Purchase ID"].value_counts()
Female_PID = len(F_ID)
Female_PID

113

In [21]:
O_ID = df.loc["Other / Non-Disclosed","Purchase ID"].value_counts()
Other_PID = len(O_ID)
Other_PID

15

In [22]:
MTPV = df.loc["Male", "Price"].sum()
MTPV

1967.64

In [23]:
FTPV = df.loc["Female", "Price"].sum()
FTPV

361.94

In [24]:
OTPV = df.loc["Other / Non-Disclosed", "Price"].sum()
OTPV

50.19

In [25]:
Round_F = round((FTPV/Female_PID),2)
Round_F

3.2

In [26]:
Round_M = round((MTPV/Male_PID),2)
Round_M

3.02

In [27]:
Round_O = round((OTPV/Other_PID),2)
Round_O

3.35

In [28]:
Round_Avg_F = round((FTPV/Female_Total),2)
Round_Avg_F

4.47

In [29]:
Round_Avg_M = round((MTPV/Male_Total),2)
Round_Avg_M

4.07

In [30]:
Round_Avg_O = round((OTPV/Other_Total),2)
Round_Avg_O

4.56

In [31]:
purch_analysis_df = pd.DataFrame(
    {"Purchase Count": [" ",Female_PID,Male_PID,Other_PID],
    "Average Purchase Price": [" ","$" + str(Round_F) +"0","$" + str(Round_M),"$" + str(Round_O)],
    "Total Purchase Value": [" ","$" + str(FTPV),"$" + str(MTPV),"$" + str(OTPV)],
    "Avg Total Purchase per Person": [" ",'$'+str(Round_Avg_F),'$'+str(Round_Avg_M),'$'+str(Round_Avg_O)]
    },
    index = ["Gender", "Female", "Male", "Other/Non-Disclosed"]
)
purch_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other/Non-Disclosed,15,$3.35,$50.19,$4.56

In [93]:
purchase_analysis = purchase_data.groupby("Gender")["Purchase ID"].count()
tot_purch_value = purchase_data.groupby("Gender")["Price"].sum()
avg_purch_value = purchase_data.groupby("Gender")["Price"].mean()
gender_totals = purchase_data.groupby("Gender")["SN"].nunique()
gender_totals

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [95]:
purchase_analysis_df = pd.DataFrame({"Purchase Count": purchase_analysis,
                                    "Average Purchase Price": avg_purch_value,
                                    "Total Purchase Value": tot_purch_value,
                                     "Avg Total Purchase per Person": tot_purch_value/gender_totals,
                                    })
purchase_analysis_df.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${:.2f}", "Avg Total Purchase per Person": "${:.2f}"})

In [32]:
age_bin = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]

age_groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [33]:
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], age_bin, labels = age_groups, include_lowest = True)

In [45]:
tot_count = purchase_data.groupby('Age Range')["SN"].nunique()
tot_count
percentage_players = tot_count/Length * 100
percentage_players

Age Range
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [42]:
age_demographics_df = pd.DataFrame(
    {"Total Count": tot_count,
 "Percentage of Players": percentage_players,
    }
)
age_demographics_df.style.format({"Percentage of Players": "{:.2f}%"})

In [55]:
age_df = pd.DataFrame(
    {"Purchase Count": purchase_data.groupby('Age Range')['SN'].count(),
     "Average Purchase Price": (purchase_data.groupby('Age Range')["Price"].sum()/purchase_data.groupby('Age Range')['SN'].count()),
    "Total Purchase Value": purchase_data.groupby('Age Range')["Price"].sum(),
     "Avg Total Purchase per Person": (purchase_data.groupby('Age Range')["Price"].sum()/length_totals),
     }
)
age_df.style.format({"Average Purchase Price": "${:.2f}","Total Purchase Value": "${:,.2f}","Avg Total Purchase per Person": "${:.2f}"})

In [56]:
top_spender_df = pd.DataFrame(
{"Purchase Count": purchase_data.groupby('SN')['Purchase ID'].count(),
 "Average Purchase Price": (purchase_data.groupby('SN')["Price"].sum()/purchase_data.groupby('SN')['Purchase ID'].count()),
"Total Purchase Value": purchase_data.groupby('SN')["Price"].sum()
})
top_spender_df

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [58]:
top_spender_df.sort_values(by=['Total Purchase Value'], inplace=True, ascending=False)
top_spender_df.head(5).style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})

In [64]:
Pop_df = pd.DataFrame(
{"Purchase Count": purchase_data.groupby("Item ID")["Item Name"].count(),
 "Item Price": (purchase_data.groupby("Item ID")["Price"].sum()/purchase_data.groupby("Item ID")["Item Name"].count()),
"Total Purchase Value": purchase_data.groupby("Item ID")["Price"].sum()
})
Pop_df

         Purchase Count  Item Price  Total Purchase Value
Item ID
0                     4      1.2800                  5.12
1                     4      2.9425                 11.77
2                     6      2.4800                 14.88
3                     6      2.4900                 14.94
4                     5      1.7000                  8.50
...                 ...         ...                   ...
178                  12      4.2300                 50.76
179                   6      4.4800                 26.88
181                   5      1.6600                  8.30
182                   3      4.0300                 12.09
183                   3      1.0900                  3.27

[179 rows x 3 columns]

In [65]:
Pop_df.sort_values(by=('Purchase Count'), inplace=True, ascending=False)
Pop_df.head(5).style.format({"Item Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})

In [67]:
Pop_df.sort_values(by=('Total Purchase Value'), inplace=True, ascending=False)
Pop_df.head(5).style.format({"Item Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})